#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Sat Oct 30 21:13:03 2021
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 60 -waveform {0 30} -name vsysclk 
group_path -name I2R -from [list [get_ports {i_add2[0]}] [get_ports {i_add2[1]}] [get_ports {i_add2[2]}] [get_ports {i_add2[3]}] [get_ports {i_add2[4]}] [get_ports {i_add2[5]}] [get_ports {i_add2[6]}] [get_ports {i_add2[7]}] [get_ports {i_add2[8]}] [get_ports {i_add2[9]}] [get_ports {i_add2[10]}] [get_ports {i_add2[11]}] [get_ports {i_add2[12]}] [get_ports {i_add2[13]}] [get_ports {i_add2[14]}] [get_ports {i_add2[15]}] [get_ports {i_add1[0]}] [get_ports {i_add1[1]}] [get_ports {i_add1[2]}] [get_ports {i_add1[3]}] [get_ports {i_add1[4]}] [get_ports {i_add1[5]}] [get_ports {i_add1[6]}] [get_ports {i_add1[7]}] [get_ports {i_add1[8]}] [get_ports {i_add1[9]}] [get_ports {i_add1[10]}] [get_ports {i_add1[11]}] [get_ports {i_add1[12]}] [get_ports {i_add1[13]}] [get_ports {i_add1[14]}] [get_ports {i_add1[15]}]]
group_path -name I2O -from [list [get_ports {i_add2[0]}] [get_ports {i_add2[1]}] [get_ports {i_add2[2]}] [get_ports {i_add2[3]}] [get_ports {i_add2[4]}] [get_ports {i_add2[5]}] [get_ports {i_add2[6]}] [get_ports {i_add2[7]}] [get_ports {i_add2[8]}] [get_ports {i_add2[9]}] [get_ports {i_add2[10]}] [get_ports {i_add2[11]}] [get_ports {i_add2[12]}] [get_ports {i_add2[13]}] [get_ports {i_add2[14]}] [get_ports {i_add2[15]}] [get_ports {i_add1[0]}] [get_ports {i_add1[1]}] [get_ports {i_add1[2]}] [get_ports {i_add1[3]}] [get_ports {i_add1[4]}] [get_ports {i_add1[5]}] [get_ports {i_add1[6]}] [get_ports {i_add1[7]}] [get_ports {i_add1[8]}] [get_ports {i_add1[9]}] [get_ports {i_add1[10]}] [get_ports {i_add1[11]}] [get_ports {i_add1[12]}] [get_ports {i_add1[13]}] [get_ports {i_add1[14]}] [get_ports {i_add1[15]}]]  -to [list [get_ports {o_result[0]}] [get_ports {o_result[1]}] [get_ports {o_result[2]}] [get_ports {o_result[3]}] [get_ports {o_result[4]}] [get_ports {o_result[5]}] [get_ports {o_result[6]}] [get_ports {o_result[7]}] [get_ports {o_result[8]}] [get_ports {o_result[9]}] [get_ports {o_result[10]}] [get_ports {o_result[11]}] [get_ports {o_result[12]}] [get_ports {o_result[13]}] [get_ports {o_result[14]}] [get_ports {o_result[15]}] [get_ports {o_result[16]}]]
group_path -name R2O -to [list [get_ports {o_result[0]}] [get_ports {o_result[1]}] [get_ports {o_result[2]}] [get_ports {o_result[3]}] [get_ports {o_result[4]}] [get_ports {o_result[5]}] [get_ports {o_result[6]}] [get_ports {o_result[7]}] [get_ports {o_result[8]}] [get_ports {o_result[9]}] [get_ports {o_result[10]}] [get_ports {o_result[11]}] [get_ports {o_result[12]}] [get_ports {o_result[13]}] [get_ports {o_result[14]}] [get_ports {o_result[15]}] [get_ports {o_result[16]}]]
set_load 10 [get_ports {o_result[16]}]
set_load 10 [get_ports {o_result[15]}]
set_load 10 [get_ports {o_result[14]}]
set_load 10 [get_ports {o_result[13]}]
set_load 10 [get_ports {o_result[12]}]
set_load 10 [get_ports {o_result[11]}]
set_load 10 [get_ports {o_result[10]}]
set_load 10 [get_ports {o_result[9]}]
set_load 10 [get_ports {o_result[8]}]
set_load 10 [get_ports {o_result[7]}]
set_load 10 [get_ports {o_result[6]}]
set_load 10 [get_ports {o_result[5]}]
set_load 10 [get_ports {o_result[4]}]
set_load 10 [get_ports {o_result[3]}]
set_load 10 [get_ports {o_result[2]}]
set_load 10 [get_ports {o_result[1]}]
set_load 10 [get_ports {o_result[0]}]
set_input_transition 0.1 [get_ports {i_add1[15]}]
set_input_transition 0.1 [get_ports {i_add1[14]}]
set_input_transition 0.1 [get_ports {i_add1[13]}]
set_input_transition 0.1 [get_ports {i_add1[12]}]
set_input_transition 0.1 [get_ports {i_add1[11]}]
set_input_transition 0.1 [get_ports {i_add1[10]}]
set_input_transition 0.1 [get_ports {i_add1[9]}]
set_input_transition 0.1 [get_ports {i_add1[8]}]
set_input_transition 0.1 [get_ports {i_add1[7]}]
set_input_transition 0.1 [get_ports {i_add1[6]}]
set_input_transition 0.1 [get_ports {i_add1[5]}]
set_input_transition 0.1 [get_ports {i_add1[4]}]
set_input_transition 0.1 [get_ports {i_add1[3]}]
set_input_transition 0.1 [get_ports {i_add1[2]}]
set_input_transition 0.1 [get_ports {i_add1[1]}]
set_input_transition 0.1 [get_ports {i_add1[0]}]
set_input_transition 0.1 [get_ports {i_add2[15]}]
set_input_transition 0.1 [get_ports {i_add2[14]}]
set_input_transition 0.1 [get_ports {i_add2[13]}]
set_input_transition 0.1 [get_ports {i_add2[12]}]
set_input_transition 0.1 [get_ports {i_add2[11]}]
set_input_transition 0.1 [get_ports {i_add2[10]}]
set_input_transition 0.1 [get_ports {i_add2[9]}]
set_input_transition 0.1 [get_ports {i_add2[8]}]
set_input_transition 0.1 [get_ports {i_add2[7]}]
set_input_transition 0.1 [get_ports {i_add2[6]}]
set_input_transition 0.1 [get_ports {i_add2[5]}]
set_input_transition 0.1 [get_ports {i_add2[4]}]
set_input_transition 0.1 [get_ports {i_add2[3]}]
set_input_transition 0.1 [get_ports {i_add2[2]}]
set_input_transition 0.1 [get_ports {i_add2[1]}]
set_input_transition 0.1 [get_ports {i_add2[0]}]
set_input_delay 0.7 [get_ports {i_add1[15]}]
set_input_delay 0.7 [get_ports {i_add1[14]}]
set_input_delay 0.7 [get_ports {i_add1[13]}]
set_input_delay 0.7 [get_ports {i_add1[12]}]
set_input_delay 0.7 [get_ports {i_add1[11]}]
set_input_delay 0.7 [get_ports {i_add1[10]}]
set_input_delay 0.7 [get_ports {i_add1[9]}]
set_input_delay 0.7 [get_ports {i_add1[8]}]
set_input_delay 0.7 [get_ports {i_add1[7]}]
set_input_delay 0.7 [get_ports {i_add1[6]}]
set_input_delay 0.7 [get_ports {i_add1[5]}]
set_input_delay 0.7 [get_ports {i_add1[4]}]
set_input_delay 0.7 [get_ports {i_add1[3]}]
set_input_delay 0.7 [get_ports {i_add1[2]}]
set_input_delay 0.7 [get_ports {i_add1[1]}]
set_input_delay 0.7 [get_ports {i_add1[0]}]
set_input_delay 0.7 [get_ports {i_add2[15]}]
set_input_delay 0.7 [get_ports {i_add2[14]}]
set_input_delay 0.7 [get_ports {i_add2[13]}]
set_input_delay 0.7 [get_ports {i_add2[12]}]
set_input_delay 0.7 [get_ports {i_add2[11]}]
set_input_delay 0.7 [get_ports {i_add2[10]}]
set_input_delay 0.7 [get_ports {i_add2[9]}]
set_input_delay 0.7 [get_ports {i_add2[8]}]
set_input_delay 0.7 [get_ports {i_add2[7]}]
set_input_delay 0.7 [get_ports {i_add2[6]}]
set_input_delay 0.7 [get_ports {i_add2[5]}]
set_input_delay 0.7 [get_ports {i_add2[4]}]
set_input_delay 0.7 [get_ports {i_add2[3]}]
set_input_delay 0.7 [get_ports {i_add2[2]}]
set_input_delay 0.7 [get_ports {i_add2[1]}]
set_input_delay 0.7 [get_ports {i_add2[0]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[16]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[15]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[14]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[13]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[12]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[11]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[10]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[9]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[8]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[7]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[6]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[5]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[4]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[3]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[2]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[1]}]
set_output_delay 18 -clock vsysclk [get_ports {o_result[0]}]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary_45nm_LVT}] -max  worst_low
